
### :memo: PR Summary

**Summary**: This PR improves the performance of the system by refactoring the data processing module.

---

### :rocket: Detailed View

**Changes made:**
- Refactored data processing logic in `data_processor.py`.
- Optimized the database queries for better performance.
- Added unit tests for the new functions.

**Performance improvements**:
- Data processing time reduced by 20%.
- CPU usage during peak times dropped by 15%.

---

:checkered_flag: Ready for review!

---

### :bulb: Notes:
Please test on the staging environment before merging. :warning:

---

<details>
  <summary>Click to see the detailed data</summary>

  Here is the data from the text file:

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
Terraform will perform the following actions:
  # local_file.foo will be created
  + resource "local_file" "foo" {
      + content              = "foo!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "foo"
      + id                   = (known after apply)
    }
Plan: 1 to add, 0 to change, 0 to destroy.




</details>
